tamapochi1/Sonar/Documents/an_r01an2238jj0121_usb/workspace/RX63N/r_usb_basic/src/driver/r_usb_hlibusbip.c
/******************************************************************************
 Function Name   : usb_hstd_ovrcr_enable
 Description     : Enable OVRCR interrupt of the specified USB port.
 Arguments       : usb_utr_t *ptr   : Pointer to usb_utr_t structure.
                 : uint16_t port    : root port
 Return value    : none
 ******************************************************************************/
void usb_hstd_ovrcr_enable (usb_utr_t *ptr, uint16_t port)
{

    hw_usb_hclear_sts_ovrcr(ptr, port);
    hw_usb_hset_enb_ovrcre(ptr, port);

}
/******************************************************************************
 End of function usb_hstd_ovrcr_enable
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hstd_ovrcr_disable
 Description     : Disable OVRCR interrupt of the specified USB port.
 Arguments       : usb_utr_t *ptr   : Pointer to usb_utr_t structure.
                 : uint16_t port    : root port
 Return value    : none
 ******************************************************************************/
void usb_hstd_ovrcr_disable (usb_utr_t *ptr, uint16_t port)
{
    /* OVRCR Clear(INT_N edge sense) */
    hw_usb_hclear_sts_ovrcr(ptr, port);

    /* Over-current disable */
    hw_usb_hclear_enb_ovrcre(ptr, port);
}
/******************************************************************************
 End of function usb_hstd_ovrcr_disable
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hstd_attch_enable
 Description     : Enable ATTCH (attach) interrupt of the specified USB port.
 Arguments       : usb_utr_t *ptr   : Pointer to usb_utr_t structure.
                 : uint16_t port    : root port
 Return value    : none
 ******************************************************************************/
void usb_hstd_attch_enable (usb_utr_t *ptr, uint16_t port)
{

    /* ATTCH status Clear */
    hw_usb_hclear_sts_attch(ptr, port);

    /* Attach enable */
    hw_usb_hset_enb_attche(ptr, port);

}
/******************************************************************************
 End of function usb_hstd_attch_enable
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hstd_attch_disable
 Description     : Disable ATTCH (attach) interrupt of the specified USB port.
 Arguments       : usb_utr_t *ptr   : Pointer to usb_utr_t structure.
                 : uint16_t port    : root port
 Return value    : none
 ******************************************************************************/
void usb_hstd_attch_disable (usb_utr_t *ptr, uint16_t port)
{

    /* ATTCH Clear(INT_N edge sense) */
    hw_usb_hclear_sts_attch(ptr, port);

    /* Attach disable */
    hw_usb_hclear_enb_attche(ptr, port);

}
/******************************************************************************
 End of function usb_hstd_attch_disable
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hstd_dtch_enable
 Description     : Enable DTCH (detach) interrupt of the specified USB port. 
 Arguments       : usb_utr_t *ptr   : Pointer to usb_utr_t structure.
                 : uint16_t port    : root port
 Return value    : none
 ******************************************************************************/
void usb_hstd_dtch_enable (usb_utr_t *ptr, uint16_t port)
{

    /* DTCH Clear */
    hw_usb_hclear_sts_dtch(ptr, port);

    /* Detach enable */
    hw_usb_hset_enb_dtche(ptr, port);

}
/******************************************************************************
 End of function usb_hstd_dtch_enable
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hstd_dtch_disable
 Description     : Disable DTCH (detach) interrupt of the specified USB port.  
 Arguments       : usb_utr_t *ptr   : Pointer to usb_utr_t structure.
                 : uint16_t port    : root port
 Return value    : none
 ******************************************************************************/
void usb_hstd_dtch_disable (usb_utr_t *ptr, uint16_t port)
{

    /* DTCH Clear(INT_N edge sense) */
    hw_usb_hclear_sts_dtch(ptr, port);

    /* Detach disable */
    hw_usb_hclear_enb_dtche(ptr, port);

}
/******************************************************************************
 End of function usb_hstd_dtch_disable
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hstd_set_pipe_register
 Description     : Set up USB registers to use specified pipe (given in infor-
                 : mation table).
 Arguments       : usb_utr_t *ptr       : Pointer to usb_utr_t structure.
                 : uint16_t pipe_no     : pipe number
                 : uint16_t *tbl        : pipe information table 
 Return value    : none
 ******************************************************************************/
void usb_hstd_set_pipe_register (usb_utr_t *ptr, uint16_t pipe_no, uint16_t *tbl)
{
    uint16_t i;
    uint16_t pipe;
    uint16_t buf;

    /* PIPE USE check */
    if (USB_USEPIPE == pipe_no)
    {
        /* EP Table loop */
        for (i = 0; USB_PDTBLEND != tbl[i]; i += USB_EPL)
        {
            /* PipeNo Number */
            pipe = (uint16_t) (tbl[i + 0] & USB_CURPIPE);

            /* Current FIFO port Clear */
            buf = hw_usb_read_fifosel(ptr, USB_CUSE);
            if ((buf & USB_CURPIPE) == pipe)
            {
                usb_cstd_chg_curpipe(ptr, (uint16_t) USB_PIPE0, (uint16_t) USB_CUSE, USB_FALSE);
            }
            buf = hw_usb_read_fifosel( ptr, USB_D0DMA );
            if ((buf & USB_CURPIPE) == pipe)
            {
                usb_cstd_chg_curpipe(ptr, (uint16_t) USB_PIPE0, (uint16_t) USB_D0USE, USB_FALSE);
            }
            buf = hw_usb_read_fifosel( ptr, USB_D1DMA );
            if ((buf & USB_CURPIPE) == pipe)
            {
                usb_cstd_chg_curpipe(ptr, (uint16_t) USB_PIPE0, (uint16_t) USB_D1USE, USB_FALSE);
            }

            /* PIPE Setting */
            usb_cstd_pipe_init(ptr, pipe, tbl, i);
        }
    }
    else
    {
        /* Current FIFO port Clear */
        usb_cstd_chg_curpipe(ptr, (uint16_t) USB_PIPE0, (uint16_t) USB_CUSE, USB_FALSE);
        buf = hw_usb_read_fifosel(ptr, USB_D0USE);
        if ((buf & USB_CURPIPE) == pipe_no)
        {
            usb_cstd_chg_curpipe(ptr, (uint16_t) USB_PIPE0, (uint16_t) USB_D0USE, USB_FALSE);
        }
        buf = hw_usb_read_fifosel(ptr, USB_D1USE);
        if ((buf & USB_CURPIPE) == pipe_no)
        {
            usb_cstd_chg_curpipe(ptr, (uint16_t) USB_PIPE0, (uint16_t) USB_D1USE, USB_FALSE);
        }

        /* EP Table loop */
        for (i = 0; USB_PDTBLEND != tbl[i]; i += USB_EPL)
        {
            /* PipeNo Number */
            pipe = (uint16_t) (tbl[i + 0] & USB_CURPIPE);
            if (pipe == pipe_no)
            {
                /* PIPE Setting */
                usb_cstd_pipe_init(ptr, pipe, tbl, i);
            }
        }
    }
}
/******************************************************************************
 End of function usb_hstd_set_pipe_register
 ******************************************************************************/

